; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared6 - mode
	spectrograph0 - mode
	image1 - mode
	infrared3 - mode
	image5 - mode
	thermograph2 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	Star3 - direction
	GroundStation7 - direction
	Star4 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 infrared6)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 thermograph2)
	(have_image Planet13 infrared6)
	(have_image Planet14 image5)
	(have_image Planet14 spectrograph0)
	(have_image Planet15 infrared3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
3. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 1 of 6
7. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 1 of 6
8. (take_image satellite0 planet13 instrument0 infrared6)
   added: (have_image planet13 infrared6)
   goals met: 2 of 6
9. (take_image satellite0 planet13 instrument0 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 3 of 6
10. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 3 of 6
11. (take_image satellite0 planet14 instrument0 image5)
   added: (have_image planet14 image5)
   goals met: 4 of 6
12. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 5 of 6
13. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 5 of 6
14. (take_image satellite0 planet15 instrument0 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 6 of 6
